ch12/ch12-signaling-adversity.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Signaling Adversity</title>
<meta name="author" content="Sergio Benítez"/>
<meta name="description" content="Thank goodness we don't have only serius problems, but ridiculous ones as well"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/night.css" id="theme"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Signaling Adversity</h1><h2 class="author">Sergio Benítez</h2>
</section>

<section>
<section id="slide-org779ae63">
<h2 id="org779ae63">Outline</h2>
<p>
The chapter will include:
</p>
<ul>
<li><code>Nothing</code>, or <code>Just Maybe</code></li>
<li><code>Either</code> left or right, but not both</li>
<li>higher-kindedness</li>
<li>anamorphisms, but not animorphs</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgc38e46a">
<h2 id="orgc38e46a">Signaling adversity</h2>
<p>
Sometimes it is not convenient for every value in a datatype to make sense for your programs.
When that happens in Haskell the <code>Maybe</code> and <code>Either</code> datatypes come to rescue.
</p>

</section>
</section>
<section>
<section id="slide-orgc046dc2">
<h2 id="orgc046dc2">Love <code>Nothing</code></h2>
<p>
Let's consider the definition of <code>Maybe</code>:
</p>

<div class="org-src-container">

<pre><code class=" haskell" >data Maybe a = Nothing | Just a
</code></pre>
</div>

<p>
<code>Maybe</code> is a very common datatype in Haskell 😅
</p>

<aside class="notes">
<p>
Maybe lets us return a default Nothing value when we don't have any sensible values to return for our intended type a
</p>

</aside>

</section>
<section id="slide-orgd8a2d87">
<h3 id="orgd8a2d87">Example</h3>
<div class="org-src-container">

<pre><code class=" haskell" >ifEvenAdd2 :: Integer -&gt; Integer
ifEvenAdd2 n = if even n then n + 2 else 🤔?
</code></pre>
</div>

</section>
<section id="slide-orgc687130">
<h3 id="orgc687130">Maybe to rescue</h3>
<div class="org-src-container">

<pre><code class=" haskell" >ifEvenAdd2 :: Integer -&gt; Maybe Integer
ifEvenAdd2 n = if even n then n + 2 else Nothing
</code></pre>
</div>

<p>
Is an improvement, but still we have some problems
</p>

<aside class="notes">
<p>
Problems with this example:
</p>
<ol>
<li>Nothing has the type Maybe a, and a can be assumed to be any type.</li>
<li>Error: Couldn't match expected type 'Maybe Integer' with actual type 'Integer'</li>
<li>Solution: Wrap into the 'Just' constructor</li>

</ol>
<p>
This is no problem to fix with <code>Maybe</code>
</p>

</aside>

</section>
<section id="slide-org6ae46c1">
<h3 id="org6ae46c1">Final version</h3>
<div class="org-src-container">

<pre><code class=" haskell" >ifEvenAdd2 :: Integer -&gt; Maybe Integer
ifEvenAdd2 n = if even n then Just (n + 2) else Nothing
</code></pre>
</div>

</section>
<section id="slide-org7f4edb5">
<h3 id="org7f4edb5">Smart constructors for datatype I</h3>
<p>
Let's consider the next <code>Person</code> type
</p>

<div class="org-src-container">

<pre><code class=" haskell" >type Name = String
type Age = Integer

data Person = Person Name Age deriving Show
</code></pre>
</div>

<aside class="notes">
<p>
Problems with this example:
</p>
<ol>
<li>We can construct a Person with an empty string as name</li>
<li>We can construct a Person with an negative years old</li>

</ol>
<p>
This is no problem to fix with <code>Maybe</code>
</p>

</aside>

</section>
<section id="slide-org72326ae">
<h3 id="org72326ae">Smart constructors for datatype II</h3>
<p>
Fit the <code>Person</code> type
</p>

<div class="org-src-container">

<pre><code class=" haskell" data-line-numbers='1-3'>type Name = String
type Age = Integer

data Person = Person Name Age deriving Show

mkPerson :: Name -&gt; Age -&gt; Maybe Person
mkPerson :: name age
  | name /= "" &amp;&amp; age &gt;= 0 = Just $ Person name age
  | otherwise = Nothing
</code></pre>
</div>

<aside class="notes">
<p>
How to know if was the name, the age or both that was bad?
</p>

</aside>

</section>
<section id="slide-org25949a1">
<h3 id="org25949a1">Smart constructors for datatype III</h3>
<p>
<code>mkPerson</code> is what we call a smart constructor. It allows us to construct values of a type
only when they meet certain criteria, so that we know we have a valid value,
and return an explicit signal when we do not.
</p>

</section>
</section>
<section>
<section id="slide-org4f5bb9f">
<h2 id="org4f5bb9f">Bleating <code>Either</code></h2>
<p>
Let's check the <code>Either</code> datatype
</p>

<div class="org-src-container">

<pre><code class=" haskell" >data Either a b = Left a | Right b
</code></pre>
</div>

</section>
<section id="slide-org3905b58">
<h3 id="org3905b58">Remember the goal</h3>
<p>
What we want is a way to know <i>why</i> our inputs were incorrect <i>if</i> they were incorrect
</p>

</section>
<section id="slide-orgf380b03">
<h3 id="orgf380b03">Initial proposal I</h3>
<p>
Define and <code>PersonInvalid</code> data constructor,
</p>
<div class="org-src-container">

<pre><code class=" haskell" >data PersonInvalid = NameEmpty 
                   | AgeTooLow
                   deriving (Eq, Show)
</code></pre>
</div>

<aside class="notes">
<p>
<code>Eq</code> because otherwise we cannot equality check the constructors
</p>

</aside>

<p>
and use it in the definition of the <code>mkPerson</code> data type:
</p>

<div class="org-src-container">

<pre><code class=" haskell" >mkPerson :: Name -&gt; Age -&gt; Either PersonInvalid Person
</code></pre>
</div>

</section>
<section id="slide-orgfdd4f5b">
<h3 id="orgfdd4f5b">Initial proposal II</h3>
<div class="org-src-container">

<pre><code class=" haskell" >type Name = String
type Age = Integer

data Person = Person Name Age deriving Show
data PersonInvalid = NameEmpty
                   | AgeTooLow
                   deriving (Eq, Show)

mkPerson :: Name
          -&gt; Age
          -&gt; Either PersonInvalid Person

mkPerson name age
| name /= "" &amp;&amp; age &gt;= 0 = Right $ Person name age
| name = "" = Left NameEmpty
| otherwise = Left AgeTooLow
</code></pre>
</div>

</section>
<section id="slide-org453c8ea">
<h3 id="org453c8ea">The <code>Left</code> and <code>Right</code> Convention</h3>
<p>
We use <code>Left</code> as our invalid or error constructor for a couple of
reasons. It is conventional to do so in Haskell, but that convention
came about for a reason. The reason has to do with the ordering of
type arguments and application of functions.
</p>

<blockquote>
<p>
<code>Functor</code> spoiler
</p>
</blockquote>

</section>
<section id="slide-orgd1c8281">
<h3 id="orgd1c8281">Another problem</h3>
<p>
We can't identify when both inputs are incorrect
</p>

</section>
<section id="slide-org13cddcd">
<h3 id="org13cddcd">The final version</h3>
<div class="org-src-container">

<pre><code class=" haskell" >type Name = String
type Age = Integer
type ValidatePerson a = Either [PersonInvalid] a

data Person = Person Name Age deriving Show
data PersonInvalid = NameEmpty
                   | AgeTooLow
                   deriving (Eq, Show)

ageOkay :: Age -&gt; Either [PersonInvalid] Age
ageOkay age = case age &gt;= 0 of
  True -&gt; Right age
  False -&gt; Left [AgeTooLow]

nameOkay :: Name -&gt; Either [PersonInvalid] Name
nameOkay name = case name /= "" of
  True -&gt; Right name
  False -&gt; Left [NameEmpty]

mkPerson :: Name
         -&gt; Age
         -&gt; Either ValidatePerson Person

mkPerson name age =
  mkPerson' (nameOkay name) (ageOkay age)

mkPerson' :: ValidatePerson Name
          -&gt; ValidatePerson Age
          -&gt; ValidatePerson Person

mkPerson' (Right nameOk) (Right ageOk) =
  Right (Person nameOk ageOk)
mkPerson' (Left badName) (Left badAge) =
  Left (Person badName ++ badAge)
mkPerson' (Left badName) _ = Left badName
mkPerson' (Left badAge) _ = Left badAge
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org5a7fbab">
<h2 id="org5a7fbab">Kinds, a thousand stars in your types</h2>
<p>
Kinds are types one level up. They are used to describe the types
of type constructors. One noteworthy feature of Haskell is that it
has <i>higher-kinded types</i>
</p>

</section>
<section id="slide-org56925a0">
<h3 id="org56925a0">Haskell report convention</h3>
<ul>
<li><i>Type constant</i>: types that no take arguments and already are types (e.g <code>Int</code>, <code>Bool</code>, <code>Char</code>)</li>
<li><i>Type constructor</i>: types which must have arguments applied to become a type</li>

</ul>

<blockquote>
<p>
Remember: The syntax <code>::</code> usually means "has type of"
</p>
</blockquote>

</section>
<section id="slide-org0426768">
<h3 id="org0426768">Type constructor example</h3>
<div class="org-src-container">

<pre><code class=" haskell" >data Exampe a = Blah | RoofGoats | Woot a
</code></pre>
</div>

<p>
<code>Example</code> is a type constructor rather than a constant because it takes a type
argument <i><code>a</code></i> which is used with the <code>Woot</code> data constructor
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Prelude&gt; :k Example
Example :: * -&gt; *
</code></pre>
</div>

</section>
<section id="slide-orge64c0ef">
<h3 id="orge64c0ef"><code>Maybe</code> and <code>Either</code> are type constructors</h3>
<p>
The <code>Maybe</code> and <code>Either</code> datatypes we’ve just reviewed also have type
constructors rather than constants. They have to be applied to an
argument before they become concrete types.
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Prelude&gt; :k Maybe
Maybe :: * -&gt; *

Prelude&gt; :k Maybe Int
Maybe Int :: *
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" haskell" >Prelude&gt; :k Either
Either :: * -&gt; * -&gt; *

Prelude&gt; :k Either Int
Maybe Int :: * -&gt; 

Prelude&gt; :k Either Int String
Maybe Int String :: * 
</code></pre>
</div>

</section>
<section id="slide-orgdc761e0">
<h3 id="orgdc761e0">Lifted and unlifted types</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Lifted</th>
<th scope="col" class="org-left">Unlifted</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Symbol</td>
<td class="org-left">*</td>
<td class="org-left">#</td>
</tr>

<tr>
<td class="org-left">Definition</td>
<td class="org-left">Any type which can be inhabited by <i>bottom</i></td>
<td class="org-left">Any type which cannot be inhabited by <i>bottom</i></td>
</tr>

<tr>
<td class="org-left">Example</td>
<td class="org-left">Mostly the datatype we have seen and use</td>
<td class="org-left">Native machine types, and raw pointers</td>
</tr>
</tbody>
</table>

</section>
<section id="slide-org8fa722d">
<h3 id="org8fa722d">Data constructors are functions</h3>
<p>
Remember that the difference between data constants and data constructors is the <i>arity</i>.
Data constants are nullary, while data constructors are n-ary, and, for the second case
once you apply them to their arguments, they return a value of the appropriate type.
<b>i.e. data constructors really are functions.</b>
</p>

</section>
<section id="slide-org5d95ff8">
<h3 id="org5d95ff8">Examples</h3>
<p>
Nullary case
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Prelude&gt; data Trivial = Trivial deriving Show
Prelude&gt; Trivial 1 -- error: match type 'Integer -&gt; t' to 'Trivial'
</code></pre>
</div>

<p>
Unary case
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Prelude&gt; data UnaryCase = UnaryCase Int deriving Show
Prelude&gt; :t UnaryCase
UnaryCase :: Int -&gt; UnaryCase
Prelude&gt; UnaryCase 21
UnaryCase 21

Prelude&gt; UnaryCase "blah" -- error: match type '[Char]' to 'Integer'
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd35f2e5">
<h2 id="orgd35f2e5">Anamorphism</h2>
<p>
While the idea of catamorphisms is still relatively fresh in our minds,
let’s turn our attention to their dual: <i>anamorphisms</i>:
</p>

<ul>
<li><b>folds</b>, or catamorphisms, let us break data structures down then</li>
<li><b>unfolds</b>, or anamorphisms, let us build them up</li>

</ul>

</section>
<section id="slide-org40aba94">
<h3 id="org40aba94">Unfold: <code>iterate</code> and <code>unfoldr</code></h3>
<p>
<code>iterate</code> is a very limited unfold that never ends, then we must use <code>take</code> to get a finite list
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Prelude&gt; :t iterate
iterate :: (a -&gt; a) -&gt; a -&gt; [a] haskell

Prelude&gt; take 10 $ iterate (+1) 0
[0,1,2,3,4,5,6,7,8,9]
</code></pre>
</div>

<p>
<code>unfoldr</code> is more general unfold, the full monty as it were, and we can get the same thing as <code>iterate</code>
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Prelude&gt; :t unfoldr
unfoldr :: (b -&gt; Maybe (a, b)) -&gt; b -&gt; [a]

Prelude&gt; take 10 $ unfoldr (\b -&gt; Just (b, b+1)) 0
[0,1,2,3,4,5,6,7,8,9]
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org1d03de4">
<h2 id="org1d03de4">Definitions</h2>
<ol>
<li>A higher kinded type is any type whose kind has a function arrow in it and which can be described</li>

</ol>
<p>
as a type constructor rather than a type constant:
</p>

<p>
Example of higher kind:
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Maybe  :: * -&gt; *
[]     :: * -&gt; *
Either :: * -&gt; * -&gt; *
[-&gt;]     :: * -&gt; * -&gt; *
</code></pre>
</div>

<p>
Example of not higher kind:
</p>

<div class="org-src-container">

<pre><code class=" haskell" >Int    :: *
Char   :: *
String :: *
[Char] :: *
</code></pre>
</div>

<blockquote>
<p>
Note: This is not to be confused with higher kinded <i>polymorphism</i>
</p>
</blockquote>

</section>
</section>
<section>
<section id="slide-orgb975ca3">
<h2 id="orgb975ca3">Thanks</h2>
</section>
</section>
</div>
</div>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,
width: 1200,
height: 800,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'zoom', // see README of reveal.js for options
transitionSpeed: 'default',

// Optional libraries used to extend reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});
</script>
</body>
</html>
